In [2]:
pwd

'C:\\Users\\LENOVO\\Desktop\\DSBDA'

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('C:\\Users\\LENOVO\\Desktop\\DSBDA\\3Employee_income.csv')

In [4]:
df

       Name  Age  Income
0      Amit   27   70000
1     Akash   29   90000
2    Shriya   29   61000
3     Anita   28   62000
4    Sudhir   42  155000
5   Gajanan   39  160000
6    Ranjit   41  162000
7   Jyotsna   38  156000
8    Nitish   36  130000
9     Onkar   35  136000
10    Neeta   37   45000
11   Yogesh   26   48000
12   Aniket   27   51000
13  Digabar   28   49500
14    Nitin   29   53000
15   Shweta   39  165000
16  Shambhu   40   63000
17    Aliza   40   64000
18   Alizya   43   80000
19      Sid   39   82000
20    Abdul   41   58000
21     Riya   38   64000
22      Nik   27   58000
23     John   40  148000

In [5]:
df.isnull()

     Name    Age  Income
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False
4   False  False   False
5   False  False   False
6   False  False   False
7   False  False   False
8   False  False   False
9   False  False   False
10  False  False   False
11  False  False   False
12  False  False   False
13  False  False   False
14  False  False   False
15  False  False   False
16  False  False   False
17  False  False   False
18  False  False   False
19  False  False   False
20  False  False   False
21  False  False   False
22  False  False   False
23  False  False   False

In [6]:
df.isnull().sum()

Name      0
Age       0
Income    0
dtype: int64

In [7]:
df.mean()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12408\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Age          34.916667
Income    92104.166667
dtype: float64

In [10]:
df.median()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12408\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Age          37.5
Income    67000.0
dtype: float64

In [11]:
df.std()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12408\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Age           5.933814
Income    44673.204489
dtype: float64

In [12]:
df['Age'].mean()

34.916666666666664

In [13]:
df['Age'].median()

37.5

In [16]:
df1=pd.read_csv("C:\\Users\\LENOVO\\Desktop\\DSBDA\\3iris.csv")

In [17]:
df1

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [18]:
df.dtypes

Name      object
Age        int64
Income     int64
dtype: object

In [21]:
df1=pd.read_csv('C:\\Users\\LENOVO\\Desktop\\DSBDA\\3iris.csv')

In [22]:
df1

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [28]:
df1.mean()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12408\2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [33]:
df1['sepal_length'].mean()

5.843333333333334

In [35]:
df1.quantile()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12408\480777559.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.quantile()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
Name: 0.5, dtype: float64